# =====================================================
# TABLE 1 — MERGES
# =====================================================

TABLE1_MERGES = [
    (0, 0, 0, 19),
    (1, 0, 7, 0),
    (1, 10, 1, 17),
    (1, 18, 1, 19),
    (2, 10, 2, 19),
    (3, 10, 3, 19),
    (1, 1, 3, 9),
    (4, 1, 4, 9),
    (4, 10, 4, 19),
    (5, 1, 5, 4),
    (5, 5, 5, 9),
    (5, 10, 5, 14),
    (5, 15, 5, 19),
    (6, 1, 6, 9),
    (6, 10, 6, 19),
    (7, 1, 7, 9),
    (7, 10, 7, 19),
    (8, 0, 9, 9),
    (8, 10, 8, 19),
    (9, 10, 9, 19),
    (10, 0, 11, 9),
    (10, 10, 10, 19),
    (11, 10, 11, 19),
    (12, 0, 12, 9),
    (12, 10, 12, 19),
    (13, 0, 13, 9),
    (13, 10, 13, 19),
    (14, 0, 14, 19),
    (15, 0, 15, 9),
    (15, 10, 15, 19),
    (16, 0, 16, 19),
]


# =====================================================
# TABLE 1 — FIELDS
# =====================================================
# key       → ключ у data
# row, col  → куди вставляти
# format    → (необовʼязково) форматування

TABLE1_FIELDS = [
    {
        "key": "table1_title",
        "row": 0,
        "col": 0,
        "text": (
            "Certificat de sănătate animală pentru circulația "
            "necomercială a păsărilor de companie"
        ),
        "style": {
            "align": "center",
            "font": "Times New Roman",
            "size": 12,
            "bold": True,
        },
    },

    {
        "key": "certificate",
        "row": 4,
        "col": 1,
        "format": "{last_name} {first_name}",
    },

    {
        "key": "home_address",
        "row": 5,
        "col": 1,
    },

    {
        "key": "phone",
        "row": 5,
        "col": 5,
    },

    {
        "key": "entry_country",
        "row": 6,
        "col": 1,
    },

    {
        "key": "dest_country",
        "row": 7,
        "col": 1,
    },
]
